class_name: Sequential
config:
- class_name: Convolution2D
  config:
    W_constraint: null
    W_regularizer: null
    activation: linear
    activity_regularizer: null
    b_constraint: null
    b_regularizer: null
    batch_input_shape: !!python/tuple [null, 1, 401, 4]
    bias: true
    border_mode: valid
    dim_ordering: th
    init: he_normal
    input_dtype: float32
    name: convolution2d_1
    nb_col: 4
    nb_filter: 16
    nb_row: 8
    subsample: &id001 !!python/tuple [1, 1]
    trainable: true
- class_name: BatchNormalization
  config: {axis: -1, epsilon: 1.0e-06, mode: 0, momentum: 0.9, name: batchnormalization_1,
    trainable: true}
- class_name: Activation
  config: {activation: relu, name: activation_1, trainable: true}
- class_name: Convolution2D
  config:
    W_constraint: null
    W_regularizer: null
    activation: linear
    activity_regularizer: null
    b_constraint: null
    b_regularizer: null
    bias: true
    border_mode: valid
    dim_ordering: th
    init: he_normal
    name: convolution2d_2
    nb_col: 1
    nb_filter: 8
    nb_row: 3
    subsample: *id001
    trainable: true
- class_name: BatchNormalization
  config: {axis: -1, epsilon: 1.0e-06, mode: 0, momentum: 0.9, name: batchnormalization_2,
    trainable: true}
- class_name: Activation
  config: {activation: relu, name: activation_2, trainable: true}
- class_name: MaxPooling2D
  config:
    border_mode: valid
    dim_ordering: th
    name: maxpooling2d_1
    pool_size: &id002 !!python/tuple [3, 1]
    strides: *id002
    trainable: true
- class_name: Flatten
  config: {name: flatten_1, trainable: true}
- class_name: Dense
  config: {W_constraint: null, W_regularizer: null, activation: linear, activity_regularizer: null,
    b_constraint: null, b_regularizer: null, bias: true, init: he_normal, input_dim: null,
    name: dense_1, output_dim: 1, trainable: true}
- class_name: BatchNormalization
  config: {axis: -1, epsilon: 1.0e-06, mode: 0, momentum: 0.9, name: batchnormalization_3,
    trainable: true}
- class_name: Activation
  config: {activation: sigmoid, name: activation_3, trainable: true}
