class_name: Sequential
config:
- class_name: Convolution1D
  config:
    W_constraint: null
    W_regularizer: null
    activation: linear
    activity_regularizer: null
    b_constraint: null
    b_regularizer: null
    batch_input_shape: !!python/tuple [null, 200, 4]
    bias: true
    border_mode: valid
    filter_length: 11
    init: glorot_uniform
    input_dim: null
    input_dtype: float32
    input_length: null
    name: convolution1d_1
    nb_filter: 50
    subsample_length: 1
    trainable: true
- class_name: Activation
  config: {activation: relu, name: activation_1, trainable: true}
- class_name: Convolution1D
  config: {W_constraint: null, W_regularizer: null, activation: linear, activity_regularizer: null,
    b_constraint: null, b_regularizer: null, bias: true, border_mode: valid, filter_length: 11,
    init: glorot_uniform, input_dim: null, input_length: null, name: convolution1d_2,
    nb_filter: 50, subsample_length: 1, trainable: true}
- class_name: Activation
  config: {activation: relu, name: activation_2, trainable: true}
- class_name: AveragePooling1D
  config: {border_mode: valid, name: averagepooling1d_1, pool_length: 180, stride: 1,
    trainable: true}
- class_name: Flatten
  config: {name: flatten_1, trainable: true}
- class_name: Dense
  config: {W_constraint: null, W_regularizer: null, activation: linear, activity_regularizer: null,
    b_constraint: null, b_regularizer: null, bias: true, init: glorot_uniform, input_dim: null,
    name: dense_1, output_dim: 50, trainable: true}
- class_name: Activation
  config: {activation: relu, name: activation_3, trainable: true}
- class_name: Dropout
  config: {name: dropout_1, p: 0.5, trainable: true}
- class_name: Dense
  config: {W_constraint: null, W_regularizer: null, activation: linear, activity_regularizer: null,
    b_constraint: null, b_regularizer: null, bias: true, init: glorot_uniform, input_dim: null,
    name: dense_2, output_dim: 3, trainable: true}
- class_name: Activation
  config: {activation: sigmoid, name: activation_4, trainable: true}
keras_version: 1.1.2
